Revit 2027 API
ParameterTypeId.WallStructuralUsageParam Property
 "Structural Usage"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId WallStructuralUsageParam { get; }
Public Shared ReadOnly Property WallStructuralUsageParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ WallStructuralUsageParam {
	ForgeTypeId^ get ();
}
static member WallStructuralUsageParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace